{
   "fitness_companies": [  
      {  
         "name":"The Junior Gymnastics Training Centre",
         "description":"The Sky is The Limit!  Achieve Fitness Through GymnasticsLearn to execute graceful controlled movements and become more disciplined and sociable! With an agile body and an alert mind, you will become a more outstanding person at play or in school.",
         "address":"Address : Hwa Chong Institution, 661 Bukit Timah RoadHwa RoadSingaporesingapore, 269734",
         "phone":"6483 5775",
         "website":"https://www.streetdirectory.com/user_agreement.php",
         "categories":"Category:Fitness Centre,  Child Enrichment,  Children Gym,  Enrichment Course, more... Enrichment Programs,  Exercise & Fitness Classes & Instruction,  Fitness For Kids,  Fitness Program,  Gymnastic Classes,  Kids Gymnastics,  Mobile Enabled Websites"
      },
      {  
         "name":"Fitness First",
         "description":"Workout The Way You Want‎ Everything you need to make fitness part of your life is here  Why Choose Fitness First? - Largest range of classes - Highly certified trainers - 2,000 classes per week - 20 clubs island-wide - Yoga, Pilates, Zumba, Kickboxing, Muay Thai, Cardio, Dance, Circuit.",
         "address":"Address : Ang Mo Kio Hub, #B1-36, 53 Avenue 3Ang 3Singaporesingapore, 569933",
         "phone":"6483 5775",
         "website":"https://www.streetdirectory.com/user_agreement.php",
         "categories":"Category:Fitness Centre,  Fitness,  Fitness Coach,  Fitness Consultants, more... Fitness Sports Centers,  Gym,  Lose Weight,  Muay Thai Kickboxing,  Personal Trainers,  Sports"
      },
      {  
         "name":"Golds Gym Pte Ltd",
         "description":"We Have Personal Trainers Who Delivers Lose weight and gain lean muscles with us Why Choose Gold Gym? - 10 Gym Locations in Singapore - Private personal training studio with results driven coaches - We pioneered the industry in 1965 - You Get Results!",
         "address":"Address : Golds Gym Personal Training - Tanjong Pagar, ..., 86 Pagar RoadGolds Shop Houses, RoadSingaporesingapore, 088507",
         "phone":"6483 5775",
         "website":"https://www.streetdirectory.com/user_agreement.php",
         "categories":"Category:Fitness Centre,  Children Gym,  Circuit Gym,  Fitness,  Fitness Corners, more... Fitness For Kids,  Fitness Instructor Course,  Gym,  Kids Gym,  Kids Gymnastics,  Ladies Gym,  Personal Coach,  Personal Trainers,  Training & Fitness"
      },
      {  
         "name":"Amore Fitness Pte Ltd",
         "description":"Leading Fitness Centre (ladies Only) in Singapore  Equipped with world-class facilities and gym equipment  - Top exclusive women-only gym in Singapore - Total wellness approach to fitness and well-being",
         "address":"Address : Amore Fitness Pte Ltd, One Commonwea..., #02-28, 1 Commonwealth LaneAmore Commonwealth, LaneSingaporesingapore, 149544",
         "phone":"6483 5775",
         "website":"https://www.streetdirectory.com/user_agreement.php",
         "categories":"Category:Fitness Centre,  Cosmetics Wholesale,  Gym,  Gymnasium, more... Health & Fitness,  Womens Fitness"
      },
      {  
         "name":"Celebrity Fitness Singapore Pte Ltd",
         "description":"",
         "address":"Address : Rochester Mall, 35 DriveRochester DriveSingaporesingapore, 138639",
         "phone":"6483 5775",
         "website":"https://www.streetdirectory.com/user_agreement.php",
         "categories":"Category:Fitness Centre,  Fitness,  Fitness Coach,  Gym,  Health & Fitness, more... Personal Trainers"
      },
      {  
         "name":"True Fitness Pte Ltd",
         "description":"Largest Gym & Fitness Centre in Asia We a complete approach to health and well-being  Visit our Gym or fitness centres to experience our fitness programs.",
         "address":"Address : True Fitness Pte Ltd @ Great World City, ..., #03- 115, 1 Kim Seng PromenadeTrue PromenadeSingaporesingapore, 237994",
         "phone":"6483 5775",
         "website":"https://www.streetdirectory.com/user_agreement.php",
         "categories":"Category:Fitness Centre,  Fitness,  Fitness Consultants,  Gym,  Lose Weight, more... Personal Trainers,  Training & Fitness"
      },
      {  
         "name":"Genesis Gym",
         "description":"Science and Results Based Programs for maximum results  Our Comprehensive system delivers results, pure and simple Unique to us, our consistency is unmatched anywhere in the world. Almost 10,000 clients have gone through our programmes over the last ten years with outstanding results.",
         "address":"Address : Genesis Gym Tras Street, Zhaolim Buil..., #02-01, 115 Eunos Avenue 3Genesis Building, 3Singaporesingapore, 409839",
         "phone":"6483 5775",
         "website":"https://www.streetdirectory.com/user_agreement.php",
         "categories":"Category:Fitness Centre,  Fitness Program,  Fitness Trainer,  Gym, more... Gymnastic Classes,  Health & Fitness,  Ladies Gym"
      },
      {  
         "name":"Acro Polates",
         "description":"Singapore 1st Combined Pole & Aerial Fitness School  Time to take Your Fitness to the Next Level  - Our Instructors are Certified - Full range of static pole dancing courses for all levels  We organise trial classes from our Aerial & Pole Classes.",
         "address":"Address : Waterloo Centre, #02-29, 261 StreetWaterloo StreetSingaporesingapore, 180261",
         "phone":"6483 5775",
         "website":"https://www.streetdirectory.com/user_agreement.php",
         "categories":"Category:Fitness Centre,  Bollywood Dance,  Dance Classes,  Exotic Dance,  Fitness, more... Health & Fitness,  Pole Dance,  Womens Fitness"
      },
      {  
         "name":"PowerMoves",
         "description":"Singapores Pilates Studio of Choice Two Stunning Garden Studios in Novena Hub & Dempsey Hill For All your Pilates Needs; - Pilates Matwork, Pilates Reformer - Clinical Pilates, PreNatal Pilates - Pilates for Golfers, Pilates for Runners, Cardio Pilates - Osteo Pilates, Total Mind-Body Wellness",
         "address":"Address : Aramsa - The Garden Spa (Bishan Par..., 1382 Ang Mo Kio Avenue 1Aramsa Park 2), 1Singaporesingapore, 569931",
         "phone":"6483 5775",
         "website":"https://www.streetdirectory.com/user_agreement.php",
         "categories":"Category:Fitness Centre,  Corporate Fitness,  Fitness Coach,  Fitness Corners, more... Fitness Instructor Course,  Fitness Sports Centers,  Fitness Trainer,  Fitness Yoga,  Personal Coach,  Personal Trainers,  Pilates,  Pilates Classes,  Social Club,  Sports Fitness,  Sports Recreation Club,  Sports Recreation Facilities,  Training & Fitness,  Womens Fitness"
      },
      {  
         "name":"Bounce",
         "description":"World Best Indoor Adventure & Trampoline Parks The go-to place for a healthy, safe and fun day out - BOUNCE can be as easy or as challenging as you like.  - Unleash Your Free Spirit with Bounce - A training ground for aerial acrobatics, a place to kick back & look out over the action, or just a hard-core form of cardio that lets you burn calories while having the time of your lifeOur Prices - $25 for 1st hr (Adults) - $25 for 1st hr Students) - $17 for 1st hr (Kids above 3yrs) - $30 for 3hrs (Fri & Sat special, 7pm to 10pm)",
         "address":"Address : Cathay Cineleisure Orchard, #09-01, 8 Grange RoadCathay RoadSingaporesingapore, 239695",
         "phone":"6483 5775",
         "website":"https://www.streetdirectory.com/user_agreement.php",
         "categories":"Category:Indoor Games,  Indoor Playground, more... Interesting Things To Do In Singapore,  Places Of Interest,  Sports Recreation Facilities"
      }
 ]
}